module.exports = [
  { // 0
    text: '(加 1 2)',
    tokens: ['(', '+', '1', '2', ')'],
    result: 3
  },
  { // 1
    text: '(减 1 2 )',
    tokens: ['(', '-', '1', '2', ')'],
    result: -1
  },
  { // 2
    text: '(  除 1 2）',
    tokens: ['(', '/', '1', '2', ')'],
    result: 0.5
  },
  { // 3
    text: '(加 3 ( - 1 2 哦。',
    tokens: ['(', '+', '3', '(', '-', '1', '2', ')', ')'],
    result: 2
  },
  { // 4
    text: '(加 3 ( - 1 2 哦哦。',
    tokens: ['(', '+', '3', '(', '-', '1', '2', ')', ')'],
    result: 2
  },
  { // 5
    text: '(加 3 ( - 1 2 哦哦',
    tokens: ['(', '+', '3', '(', '-', '1', '2', ')', ')'],
    result: 2
  },
  { // 6
    text: '（加 3（- 1 2 哦。',
    tokens: ['(', '+', '3', '(', '-', '1', '2', ')', ')'],
    result: 2
  },
  { // 7
    text: `
    (表态 (钦点 董先生 特首) 董先生 )`,
    result: '特首'
  },
  { // 8
    text: '(< 冬马 3)',
    result: false
  },
  { // 9
    text: '(= 90 (- 2016 1926) )',
    result: true
  },
  { // 10
    text: '(表态 (钦点 雪菜 碧池) (= 雪菜 碧池) )',
    result: true
  },
  { // 11
    text: '（闷声 发 大 财)',
    result: ['发', '大', '财']
  },
  { // 12
    text: `
    (+ 苟
      ( + 利
        ( + 国
          ( + 家
            ( + 生
              ( + 死
                    已
                      哦。`,
    result: '苟利国家生死已'
  },
  { // 13
    text: `
    (表态
      (钦点 续
        (奉告 (时间)
          (+ 1 时间)
        哦哦
      (续 999 哦。`,
    result: 1000
  },
  { // 14
    text: '(资辞吗 微电子工业的发展 几百个教授一致通过 不通过)',
    result: '几百个教授一致通过'
  },
  { // 15
    text: `
    (表态
      (钦点 一尺之棰日取其半
        (奉告 (余日 棰长)
          (资辞吗 (= 余日 0) 棰长 (一尺之棰日取其半 (- 余日 1) (/ 棰长 2)))
        哦哦
      (一尺之棰日取其半 3 1 哦。`,
    result: 0.125
  },
  { // 16
    text: `
    (表态
      确立了社会主义市场经济
      把邓小平理论列入党章
      三个代表
      军队一律不得经商
      九八年的抗洪
      微小的工作 哦`,
    result: '微小的工作'
  }
]
